{
    "Which of the following methodologies might be most appropriate if you have a system project with: clear requirements; very familiar technologies; not all that complex; must be reliable; a somewhat longer schedule and the schedule visibility is not important?": [
        "V-model",
        "System prototyping",
        "Waterfall",
        "Parallel",
        "Iterative"
    ],
    "In most IT departments, the demand for IT projects is generally about the same as the department's ability to supply them.": [
        "False",
        "True"
    ],
    "The majority of projects taken on by IT departments are not strategic to the business": [
        "False",
        "True"
    ],
    "If the skills required by a project cannot be met by the available project team, which would probably NOT be a reasonable solution?": [
        "Modify the project to use skills inherent on the project team",
        "Train the project team (or some of the team) on the skills needed",
        "Mentor a team member (like sending a person to work on a similar project to acquire the necessary skills)",
        "Use a contract employee",
        "Use a consultant"
    ],
    "Micah is a fairly new project manager. He estimated for a project plan (on the planning phase) that the project would cost $50,000 and take 20 weeks. According to the margin of error guidelines for well-done estimates, that could range from:": [
        "0 and $100,000 – and between 15 and 25 weeks",
        "10,000 and $60,000 – and between 12 and 28 weeks",
        "0 and $100,000 – and between 0 and 40 weeks",
        "5,000 and $100,000 – and between 10 and 30 weeks",
        "25,000 and $75,000 – and between 10 and 30 weeks"
    ],
    "Extreme programming requires a great deal of discipline and it is recommended for:": [
        "Considerable onsite user involvement",
        "Large development teams",
        "Mission critical applications",
        "Large systems",
        "All of these"
    ],
    "Which is NOT suggested for IT development projects?": [
        "Projects need to give a positive return on investment within four years",
        "Projects need to give value to the business",
        "Projects need to be carefully managed",
        "Projects need to be carefully selected",
        "Projects need to be prioritized"
    ],
    "Agile Development stresses analysis, modeling and documentation over programming.": [
        "False",
        "True"
    ],
    "The main difference between the Parallel Development Methodology and the Iterative Development Methodology is that:": [
        "The Parallel Methodology will have subprojects and the Iterative Methodology will have various releases",
        "The Parallel Development Methodology will have various releases (like version 1.0; 2.0, etc.) and the Iterative will not",
        "The Iterative Methodology will break the system project into sub-projects for analysis, design and implementation and then merge them into a final system and the Parallel will not",
        "The Parallel Methodology will create various models or prototypes with user involvement before setting on design concepts and the Iterative will not",
        "The Iterative Methodology will create various models or prototypes with user involvement before setting on design concepts and the Parallel Methodology will not"
    ],
    "Most IT departments face a demand for IT projects that far exceed the ability to do them.": [
        "True",
        "False"
    ],
    "RAD is an acronym for:": [
        "Rapid Application Development",
        "Real Application Development",
        "Rapid Application Design",
        "Rapid Authentic Development",
        "Real Autonomous Development"
    ],
    "Which of the following is NOT a classic planning mistake?": [
        "Omitting key requirements",
        "Overly optimistic schedule",
        "Failing to monitor the schedule",
        "Failing to update the schedule",
        "Adding people to a late project"
    ],
    "The V-model pays more explicit attention to ___________:": [
        "Testing",
        "Prototyping",
        "Iteration",
        "Return on investment (ROI)",
        "Business Value (the \"V\")"
    ],
    "If you had a project with very clear requirements; familiar technologies; not super complex; reliable; a very long time schedule and where the need for schedule visibility is low – the best methodology might be Extreme programming.": [
        "False",
        "True"
    ],
    "Bob is selecting a systems analysis and design methodology. What might be the first step?": [
        "Researching the organizations standards and policies for 'approved' methodologies",
        "Selecting the shortest methodology",
        "Interviewing senior management as to their suggestions on methodologies",
        "Do a quick 'cost/benefit' analysis on which methodology will provide the most benefits at the lowest cost",
        "Do an analysis on which methodology might lessen or eliminate scope creep"
    ],
    "PMP is People – Management – Project – the three components of successful project management.": [
        "False",
        "True"
    ],
    "Either systems prototyping or throwaway prototyping are generally a good methodology choice when the project has unclear user requirements.": [
        "True",
        "False"
    ],
    "The Throwaway Prototyping methodology is good at creating release version 1.0 for users; and then the methodology shifts to system prototyping to finish the system.": [
        "False",
        "True"
    ],
    "System prototyping is BEST characterized as:": [
        "A 'Quick and Dirty' system",
        "A series of versions",
        "A method for exploring design alternatives",
        "A method for stressing customer satisfaction",
        "More explicit testing"
    ],
    "Interpersonal skills for a project manager might be important when:": [
        "Working with a highly controversial project that may have political implications",
        "Using the V-model variation of the Waterfall Methodology.",
        "Creating the system proposal",
        "Making assignments for a project",
        "Creating a cost/benefit spreadsheet"
    ],
    "Nate is managing a project that is behind by one month with five months to go. He should add four to six staff persons to the project to get it back up to speed.": [
        "False",
        "True"
    ],
    "The Throwaway Prototyping methodology is especially good for exploring design alternatives.": [
        "True",
        "False"
    ],
    "Which of the following would BEST describe \"system reliability\"?": [
        "The aspect of how accurate the system must be (such as medical equipment or for games)",
        "The aspect of using technologies that analysts and developers are familiar with",
        "The aspect of what the business side really wants the system to do",
        "The aspect of how quickly the system can be developed and implemented",
        "The aspect of how complex the system must be"
    ],
    "A classic planning mistake mentioned in the textbook is motivating employees with financial rewards instead of recognition and genuine thanks.": [
        "False",
        "True"
    ],
    "A critical success factor in project management is to do which of the following?": [
        "Start with a realistic assessment of the work that needs to be done",
        "Say \"no\" to all requests as they add to 'scope creep'",
        "Use throwaway prototyping",
        "Use a CASE tool to delineate requirements from work tasks",
        "Hire an outside project management consulting group"
    ],
    "Project teams of 12 to 15 are generally considered optimum": [
        "False",
        "True"
    ],
    "Garrett has been told by management that his project MUST be completed on time. His best estimates are more than two weeks after the absolute deadline. Which technique could he use to get a functional system on time?": [
        "Timeboxing",
        "Risk management",
        "System prototyping",
        "Benchmarking",
        "Activity elimination"
    ],
    "Parallel methodology is BEST characterized as:": [
        "A series of versions",
        "A 'Quick and Dirty' system",
        "A method for exploring design alternatives",
        "A method for stressing customer satisfaction",
        "More explicit testing"
    ],
    "Which of the following methodologies might be most appropriate if you have a system project with: clear requirements; very familiar technologies; not all that complex; reasonably reliable; a short time schedule and the schedule visibility is not important?": [
        "Parallel",
        "Waterfall",
        "Iterative",
        "System prototyping",
        "Throwaway prototyping"
    ],
    "The corporate IT department carefully needs to prioritize, select and manage a portfolio of projects.": [
        "True",
        "False"
    ],
    "The project methodology that takes the longest to complete is Extreme Programming Methodology.": [
        "False",
        "True"
    ],
    "The Iterative approach of the RAD methodology breaks the overall project into a series of release versions.": [
        "True",
        "False"
    ],
    "What the MAIN difference between systems prototyping and throwaway prototyping?": [
        "Systems prototyping works with users to quickly develop a simplified working version of the proposed system; while throwaway prototyping focuses more on exploring design alternatives",
        "Systems prototyping involves users while throwaway prototyping does not",
        "Throwaway prototyping involves users while systems prototyping does not",
        "Systems prototyping is a rapid application development methodology; while throwaway prototyping is not",
        "Throwaway prototyping develops systems that will be use as 'stop-gap' systems – and generally for less than six months; while systems prototyping results in systems that will be used extensively for several years."
    ],
    "Scope creep happens when new requirements are added to the project after the original project scope was defined.": [
        "True",
        "False"
    ],
    "Which of the following methodologies might be most appropriate if you have a system project with: unclear requirements; very familiar technologies; not all that complex; reasonably reliable; a short time schedule and the schedule visibility is somewhat important?": [
        "Agile development",
        "Waterfall",
        "Parallel",
        "Iterative",
        "System prototyping"
    ],
    "TJ is coordinating a project. Which would he probably NOT use to avoid conflicts?": [
        "Encourage a competitive edge between team members",
        "Communicate the business value to the team",
        "Clearly defining plans for the project",
        "Look at other projects and priorities and see how that might impact the project",
        "Develop a project charter"
    ],
    "Which of the following methodologies might be most appropriate if you have a system project with: unclear user requirements; unfamiliar technologies; very complex; must be reliable; a short to medium time schedule and the schedule visibility is somewhat important?": [
        "Throwaway prototyping",
        "Waterfall",
        "Parallel",
        "Iterative",
        "System prototyping"
    ],
    "Which of the following methodologies might be most appropriate if you have a system project with: clear requirements; very familiar technologies; not all that complex; reasonably reliable; a very long time schedule, and the schedule visibility is not important?": [
        "Waterfall",
        "Throwaway prototyping",
        "Parallel",
        "Iterative",
        "System prototyping"
    ],
    "The project methodology that takes the longest to complete is the Waterfall Development Methodology.": [
        "True",
        "False"
    ],
    "The margin of error in cost and time estimates can be as much as 20% in the planning phase for the system proposal deliverable.": [
        "False",
        "True"
    ],
    "Rapid Application Development is a collection of methodologies that include all of the following except:": [
        "V-model Methodology",
        "Iterative Development",
        "System Prototyping",
        "Throwaway Prototyping"
    ],
    "Throwaway prototyping is BEST characterized as:": [
        "A method for exploring design alternatives",
        "A 'quick and dirty' system",
        "A series of versions",
        "A method for stressing customer satisfaction",
        "More explicit testing"
    ],
    "A team of developers and customers are in close communication, with frequent communications, simplicity, feedback and courage. This would best describe:": [
        "The extreme programming methodology",
        "The parallel development methodology",
        "The waterfall development methodology",
        "The iterative development methodology",
        "The throwaway prototyping methodology"
    ],
    "Agile development is a group of programming-centric methodologies that focus on which of the following?": [
        "Streamlining the SDLC",
        "Creating a cost/benefit spreadsheet",
        "Working with a highly controversial project that may have political implications",
        "Making assignments for a project",
        "Creating the system proposal"
    ],
    "A critical success factor for project management is to start with a realistic assessment of the work that needs to be accomplished.": [
        "True",
        "False"
    ],
    "Which of the following methodologies might be most appropriate if you have a system project with: somewhat unclear requirements; somewhat unfamiliar technologies; that is complex; reasonably reliable; a short time schedule and high schedule visibility?": [
        "Iterative",
        "Waterfall",
        "Parallel",
        "System prototyping",
        "Throwaway prototyping"
    ],
    "Which of the following methodologies might be most appropriate if you have a system project with: unclear user requirements; unfamiliar technologies; somewhat complex; needs to be reliable; time is not an issue and the schedule visibility is somewhat important?": [
        "Throwaway prototyping",
        "Waterfall",
        "Parallel",
        "Iterative",
        "System prototyping"
    ],
    "CIO is an acronym for \"Chief Information Officer\".": [
        "True",
        "False"
    ],
    "Project estimates tend to have a built-in buffer of time": [
        "False",
        "True"
    ],
    "Extreme Programming (XP) is BEST characterized as:": [
        "A method for emphasizing customer satisfaction",
        "A 'Quick and Dirty' system",
        "More explicit testing",
        "A series of versions",
        "A method for exploring design alternatives"
    ],
    "The Waterfall Methodology breaks the overall project into a series of release versions.": [
        "False",
        "True"
    ],
    "The science (or art) of project management is setting a schedule and sticking to it no matter what – even if that includes working weekends and adding staff to reach the deadline on time.": [
        "False",
        "True"
    ],
    "Which of the following methodologies takes the longest to complete all the SDLC steps?": [
        "Waterfall",
        "Parallel",
        "Iterative",
        "System prototyping",
        "Throwaway prototyping"
    ],
    "Project Managers must be certified as PMP (Project Management Professionals)": [
        "False",
        "True"
    ],
    "Which would generally NOT be taken into consideration for project portfolio management in an organization?": [
        "The number of financially feasible projects",
        "The number of large projects",
        "The number of tactical projects",
        "The number of high risk projects",
        "The number of strategic projects"
    ],
    "Which of the following is not a project characteristic that will affect the methodology selection decision?": [
        "Creating a cost/benefit spreadsheet",
        "Schedule visibility",
        "User requirements clarity",
        "Complexity of the system",
        "System reliability"
    ],
    "Throwaway Prototyping balances the benefits of well-thought-out analysis and design phases with the advantages of using prototypes to refine key issues before a system is built.": [
        "True",
        "False"
    ],
    "Which of the following would BEST describe \"system complexity\"?": [
        "The aspect of how intricate and difficult the system must be",
        "The aspect of using technologies that analysts and developers are familiar with",
        "The aspect of what the business side really wants the system to do",
        "The aspect of how quickly the system can be developed and implemented",
        "The aspect of how accurate the system must be (such as medical equipment or for games)"
    ],
    "Extreme programming emphasizes:": [
        "All of these",
        "Customer satisfaction",
        "Teamwork",
        "Communication as a core value",
        "Simplicity as a core value"
    ],
    "Extreme Programming (XP) stresses customer satisfaction and teamwork.": [
        "True",
        "False"
    ],
    "Scrum, XP and Dynamic systems development method (DSDM) are all classified as 'agile development' concepts.": [
        "True",
        "False"
    ],
    "The most common reason for schedule and cost overruns is what?": [
        "Scope creep",
        "Team conflict",
        "Lack of communication from project manager to project team",
        "Lack of support by sponsor and champion",
        "Adding people to a late project"
    ],
    "A classic planning mistake mentioned in the textbook is having an 'overly optimistic schedule'.": [
        "True",
        "False"
    ],
    "Which of the following might result in version 1; version 2 (etc.) of a system?": [
        "Iterative Development",
        "System Prototyping",
        "Waterfall Development",
        "System Prototyping",
        "Parallel Development"
    ],
    "Suggestions for motivation might include all of these EXCEPT:": [
        "Giving all team members the same bonus on a project",
        "Setting realistic deadlines",
        "Recognize and reward good efforts",
        "Reward those with outstanding quality and effort",
        "Having a good working environment"
    ],
    "Which is a true statement about IT projects?": [
        "Most IT departments face a demand for IT projects that far exceed the ability to do them.",
        "Project Managers must be certified as PMP (Project Management Professionals)",
        "Project estimates tend to have a built-in buffer of time",
        "Project teams of 12 to 15 are generally considered optimum",
        "The majority of projects taken on by IT departments are not strategic to the business"
    ]
}