{
    "The authors suggest that an analyst is 'very much like a ____________' and business users are like elusive suspects.": [
        "Detective",
        "Police professional",
        "Politician",
        "Forensic scientist",
        "Air traffic controller"
    ],
    "Probably the first thing to do when conducting an interview is:": [
        "Build rapport with the interviewee so he or she trusts you",
        "Turn on your tape recorder",
        "Get started by asking the first question on your list",
        "Ask a close ended question",
        "Ask a probing question"
    ],
    "Marta wants to focus on 'why' a particular lockout situation occurs on a customer relationship management system, rather than just developing a work-around fix. She is doing activity elimination.": [
        "False",
        "True"
    ],
    "An example of a nonfunctional requirement is ____________": [
        "System can be used in any of 100 offices worldwide",
        "Supplier table is available",
        "The system must contain customer order history for three years",
        "SQL queries from customer table and order table are available",
        "Customer zipcode is formatted as character data"
    ],
    "In terms of reaching the most number of people in requirements elicitation, interviews are considered better than questionnaires.": [
        "False",
        "True"
    ],
    "In RAD or agile development methodology (especially with BPR), a significant amount of time and effort is spent in understanding the as-is system.": [
        "False",
        "True"
    ],
    "Danielle has asked some closed-ended questions to start an interview; then some open-ended questions. Now, she wants to really wants to get a greater depth of information about the process. She would probably use _________ questions.": [
        "Probing",
        "More closed ended",
        "More open ended",
        "Boxing structure",
        "Structured"
    ],
    "An interview report is prepared in which step of the interview process?": [
        "Post interview following-up",
        "Conducting the interview",
        "Designing interview questions",
        "Preparing for the interview",
        "Selecting an interviewee"
    ],
    "Blaine is using a requirements eliciting technique that begins with non-threatening questions, avoids abbreviations, groups items into logically coherent sections, and might best be used with outside users. He probably is using what?": [
        "Questionnaires",
        "JAD session",
        "Observation",
        "Document analysis",
        "Interview"
    ],
    "The three types of interview questions are: multiple choice, fill in the blank and short answer.": [
        "False",
        "True"
    ],
    "When eliciting requirements, the most commonly used technique is: __________": [
        "Interviews",
        "Observation",
        "Joint Application Development (JAD) sessions",
        "Document Analysis",
        "Questionnaires / surveys"
    ],
    "A technique where a set of written questions are distributed to people (frequently to a large number of people) is: _____.": [
        "Questionnaires",
        "Joint Application Development (JAD) sessions",
        "Document Analysis",
        "Interviews",
        "Observation"
    ],
    "A JAD facilitator can participate in the discussion to settle a disagreement.": [
        "False",
        "True"
    ],
    "A JAD facilitator keeps track of all discussions by entering information into the computer.": [
        "False",
        "True"
    ],
    "In the interview report, what will probably NOT be included?": [
        "The actual questions that were asked as a permanent record",
        "Summary of what the interviewee said",
        "Interview's name; interviewee's name",
        "Any materials, documents, etc. that the interviewee gave you relevant to the project at hand",
        "Details from crucial areas of the interview relating to the project at hand"
    ],
    "One difference between the reports from interviews and from a JAD session is that:": [
        "The interview report is generally written within 48 hours of the interview; while the JAD session report may take a week or two after the JAD session.",
        "The JAD report will include results from questionnaires while the interview report will not",
        "It describes information from the interview or JAD session",
        "JAD reports will include technology analysis while interviews will only include root cause analysis",
        "The interview report will give a complete project management timeline; while the JAD session report will not"
    ],
    "According to the authors, in moving \"from here to there\", an analyst needs:": [
        "Strong critical thinking skills",
        "An understanding of corporate politics",
        "Knowledge on how to stop scope creep",
        "Joint Application Development facilitating skills",
        "Microsoft Project Management software skills"
    ],
    "Michael, a systems analyst, is preparing a closed wiki site for Northstate Bank. He has written permission from eight other companies to view their internal wiki sites, and also has approval from his manager and the project team to use these other sites for ideas and structure. This would be a form of:": [
        "Informal Benchmarking",
        "Business Process Automation",
        "Business Process Improvement",
        "Formal Benchmarking",
        "Technology Analysis"
    ],
    "The most commonly used requirements elicitation technique is the interview.": [
        "True",
        "False"
    ],
    "Which is generally NOT true of non-functional requirements?": [
        "Systems may need to have actual expenses from global operations",
        "Multi-lingual interfaces many be needed",
        "Color interpretations on screens and forms may be different in different geographical places",
        "Cultural differences can be considered",
        "Systems may need to adapt from global solutions to local realities"
    ],
    "Rafael, Fraud Unit Manager, has just received an interview report from Stefano, a systems analyst. Rafael was interviewed by Stefano, and was asked to make corrections and clarifications to the interview report. In what interview phase would this occur?": [
        "Post-interview follow-up",
        "Selecting interviewees",
        "Designing interview questions",
        "Preparing for the interview",
        "Conducting the interview"
    ],
    "The interview process has gone well. There are a few things that need clarification and what really happens when specific financial analysts use the system. Which of the following might be the best way to verify what does happen?": [
        "Observation of how the analysts do their work",
        "Questionnaires / survey of end users of the system",
        "Additional interviews with top level managers in the finance area",
        "A JAD session with end users, financial analysts and top managers",
        "Document analysis of what the system was to do"
    ],
    "Your company updated its processes for financial reporting when Sarbanes-Oxley became law. Additional changes in Sarbanes-Oxley reporting have been mandated to start in one year. To help you understand the as-is system, you should review the documentation, processes and procedures that were developed with the initial Sarbanes-Oxley project.": [
        "True",
        "False"
    ],
    "Yuri wants to interview both managers and staff in the accounting department for the updated credit analysis project. This is an appropriate group for first round interviews.": [
        "True",
        "False"
    ],
    "When an analyst is looking for specific, precise information they would probably choose this type of question:": [
        "Close ended",
        "Questionnaires",
        "Open Ended",
        "Observation",
        "Probing"
    ],
    "In interviews, Ross has learned that the new order entry system must be available in at least three formats (mobile, web browser, and local area network based); that it must function in either English or Spanish; and that the system must return order forms and data in less than 2 seconds. He recognizes these as nonfunctional requirements.": [
        "True",
        "False"
    ],
    "When an analyst is seeking more information from a response to questions they would probably use which type of question?": [
        "Probing questions",
        "Open Ended questions",
        "Close ended questions",
        "All of these"
    ],
    "What information-eliciting strategy enables the analyst to see the reality of the situation rather than listen to others describe it?": [
        "Observation",
        "Questionnaires",
        "Interviewing",
        "Joint application design (JAD) sessions",
        "Document analysis"
    ],
    "A JAD facilitator recognizes that some people know more about the system and proposed system and will dominate the discussion and know that is a positive thing.": [
        "False",
        "True"
    ],
    "When an analyst is seeking a more wide ranging response to questions they would probably use which type of question?": [
        "Open Ended",
        "Probing",
        "Close ended",
        "Observation"
    ],
    "The most important purpose of the requirements definition is to define the scope of the system.": [
        "True",
        "False"
    ],
    "Paul is interviewing Ming. He first explains why he is there and what he wants to accomplish in the interview. This would be done in which step of the interview process?": [
        "Conducting the interview",
        "Selecting interviewees",
        "Designing interview questions",
        "Preparing for the interview",
        "Post-interview follow-up"
    ],
    "The SDLC moves from the current system (often called the \"past system\") to the new system (often called the \"future system\").": [
        "False",
        "True"
    ],
    "Management of requirements and system scope is one of the hardest parts of managing a project.": [
        "True",
        "False"
    ],
    "Marta wants to collect facts and opinions from a wide range of geographically dispersed people quickly and with the least expense. She would probably want to use what?": [
        "Questionnaires",
        "Document analysis",
        "Observation",
        "JAD session",
        "Interview"
    ],
    "After creating the interview report you should:": [
        "Send a copy to the interviewee with a request to read it and correct or clarify",
        "Change the document into a unchangeable format (like a pdf file) so that it cannot be changed or edited",
        "Edit the report into a bulleted format for easier analysis",
        "Distribute the interview report to all others that are on the interview schedule so they will not have to go over the same materials",
        "Distribute the interview report to the interviewee's manager."
    ],
    "A JAD facilitator sets the meeting agenda.": [
        "True",
        "False"
    ],
    "Online questionnaires are growing in use, but generally online questionnaires have a lower completion rate.": [
        "True",
        "False"
    ],
    "An example of a functional requirement is _________": [
        "Access to the customer order system",
        "System should be available in English and Spanish",
        "System can be accessed through a Blackberry device",
        "Output can be displayed in Internet Explorer, in Firefox, or in Google Chrome browsers",
        "System is automatically updated every 5 seconds"
    ],
    "Gary has eight interviews to conduct over the next week. Once he has completed all interviews, he should then write up a summary report. Preparing interview reports prior to completing all interviews will generally be premature until Gary has talked to all interviewees.": [
        "False",
        "True"
    ],
    "Which is NOT a good practice in conducting interviews?": [
        "Explain thoroughly – it is estimated that in a strong interview session, the interviewer (you) should talk and explain about 60% of the time; and the interviewee should answer about 40% of the time",
        "Be happy – happy people radiate confidence",
        "If the interviewee ask you a question, answer it truthfully – and if you don't know an answer, say so",
        "Pay attention to what the interviewee is saying",
        "Watch interviewees' facial expressions, how they sit and their body language; do they cross their arms; do they lean forward?"
    ],
    "Miski has modified an existing time reporting system for hourly employees to be more efficient as they can text message when they are leaving a job site. This would be an example of Business Process Automation.": [
        "True",
        "False"
    ],
    "Cindi Flores distributed 'white-papers' on RFID, ERP, GPS and SOA to a user-management group. She then asked them to 'think outside the box' on where these technologies could be used in the company. This would be an example of \"technology analysis.\"": [
        "True",
        "False"
    ],
    "Maria, a systems analyst, is tweaking the high-level explanation of the business requirements into a more precise list of requirements. This is called 'requirements determination'.": [
        "True",
        "False"
    ],
    "Which of the following will probably NOT be at a system walkthrough?": [
        "Computer Center director",
        "Management representatives",
        "Analyst who prepared the system proposal",
        "User representatives",
        "Key decision makers"
    ],
    "Most existing systems are well documented which leads to document analysis being very valuable.": [
        "False",
        "True"
    ],
    "Interpersonal skills are those that enable a person to develop a rapport and are important for interviewing.": [
        "True",
        "False"
    ],
    "To get to more depth in understanding the as-is system, document analysis and observation generally are more beneficial as compared to interviews and JAD sessions.": [
        "False",
        "True"
    ],
    "One person dominating the group discussion of a JAD session will normally lead to a positive outcome.": [
        "False",
        "True"
    ],
    "To create the requirements definition, the project team first should consider the kinds of functional and non-functional requirements that they will collect about the system.": [
        "True",
        "False"
    ],
    "When eliciting requirements from processing clerks and lower level managers about 'how' a system works, the best approach might be: _____.": [
        "Closed-ended interview questions",
        "Root cause analysis",
        "Document analysis",
        "JAD session",
        "Probing interview questions"
    ],
    "Generally 'system requirements' are developed in the analysis phase and evolve to more technical 'business requirements' in the design phase.": [
        "False",
        "True"
    ],
    "Practical tips states that interpersonal skills are important, they include which of the following?": [
        "All of these",
        "Paying attention",
        "Being honest",
        "Ability to summarize key points",
        "Be happy"
    ],
    "In preparing for an interview, TJ does research as to areas in which the interviewee has knowledge so that he does not ask questions that an interviewee cannot answer.": [
        "True",
        "False"
    ],
    "A JAD facilitator allows sidebar discussions and unstructured activities.": [
        "False",
        "True"
    ],
    "A technique where the analyst watches how people perform their activities is _______": [
        "Observation",
        "Interviews",
        "Questionnaires / surveys",
        "Joint Application Development (JAD) sessions",
        "Document Analysis"
    ],
    "Typically, interviews do not include the following type questions:": [
        "Observation",
        "Open Ended",
        "Close ended",
        "Probing"
    ],
    "Hamid has selected one middle manager from each department that will be affected by the updated system and one lower-level manager from each department, along with a few senior staff as well as the project sponsor for a JAD session. He is trying to do what?": [
        "Have a broad mix of organizational levels in the JAD session",
        "Reduce the time necessary for the length of JAD session meetings",
        "Prevent domination by only a few individuals in the JAD session",
        "Create a new hybrid department that will beta test the final system",
        "Balance the work load for departments so the regular day-to-day functions can still continue while the JAD team is off-site"
    ],
    "Jorge, Vice President of Operations, has requested that the updated supply chain system keep a record of all 'stock-outs' for six years. This is an example of a functional requirement.": [
        "True",
        "False"
    ],
    "One of the major differences between a JAD session and an interview is what?": [
        "All JAD sessions are structured and must be carefully planned",
        "Writing up results and a report",
        "Preparing for the session",
        "Selecting participants",
        "Figuring out what is to be done"
    ],
    "Some people have suggested that the 'analysis' phase could be clearer if it was called the 'analysis and initial design' phase.": [
        "True",
        "False"
    ],
    "Generally beginning analysts should avoid unstructured interviews and likewise should avoid \"winging it\".": [
        "True",
        "False"
    ],
    "Which is NOT a requirements analysis strategy?": [
        "Understanding of screen design, layout and navigation",
        "Identifying improvements",
        "Understanding of the as-is system",
        "Developing requirements for the to-be system",
        "Root cause analysis"
    ],
    "Unless ordered by the lead analyst for a project, you should not share your interview report with those that you interviewed. Doing so will almost always result in scope creep and changes in the requirements.": [
        "False",
        "True"
    ],
    "Which is NOT a purpose of the requirements definition?": [
        "Create cost/benefit analysis",
        "Create functional requirements",
        "To give a very high-level explanation of the business requirements",
        "Create non-functional requirements",
        "A more precise list of requirements that can be used as inputs to the rest of analysis"
    ],
    "Myles is studying a system to lessen the number of complaints about the Help Desk. He has formally studied the service counter at Wal-Mart, Target and Kohl's department stores; as well as listened in to complaint phone calls to a hotel booking site. He is trying to see how other organizations work at lessening complaints and also how they handle complaints. This would be what type of analysis?": [
        "Informal benchmarking",
        "Outcome analysis",
        "Complaint processing",
        "Problem analysis",
        "Design analysis"
    ],
    "Rebecca, a fairly new employee in the company and Matt, her boss (who has been with the company for 22 years) are in your JAD session. It would probably be expected that Rebecca would not share much in the session.": [
        "True",
        "False"
    ],
    "The requirements-elicitation process is used for building financial support for the project and establishing common understanding of technologies and rapport between the project team building the system and the users of the system.": [
        "False",
        "True"
    ],
    "One of the first activities of an analyst is to determine the business requirements for the new system.": [
        "True",
        "False"
    ],
    "The line between analysis and design is sometimes very blurry. One reason is that _____:": [
        "the deliverables are really the first step in the design of the new system",
        "object-oriented methods are generally fuzzier as compared to waterfall methods",
        "scope creep has occurred",
        "analysts are generally rushed to complete the system proposal",
        "there is inadequate funding for the analysis phase to do a complete analysis"
    ]
}